#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	УстановитьПорядок(НаправлениеСортировкиКомпоновкиДанных.Возр);
	ПоказатьОповещениеПользователя(, , "Сортировка по наименованию (А→Я)");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	УстановитьПорядок(НаправлениеСортировкиКомпоновкиДанных.Убыв);
	ПоказатьОповещениеПользователя(, , "Сортировка по наименованию (Я→А)");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПорядок(Направление)
	Список.Порядок.Элементы.Очистить();
	ЭлементПорядка = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Description");
	ЭлементПорядка.ТипУпорядочивания = Направление;
	ЭлементПорядка.Использование = Истина;
КонецПроцедуры

#КонецОбласти
