#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	УстановитьПорядок(НаправлениеСортировкиКомпоновкиДанных.Возр);
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	УстановитьПорядок(НаправлениеСортировкиКомпоновкиДанных.Убыв);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПорядок(Направление)
	Список.Порядок.Элементы.Очистить();
	ЭлементПорядка = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Description");
	ЭлементПорядка.ТипУпорядочивания = Направление;
КонецПроцедуры

#КонецОбласти
