Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ПустаяСтрока(МетодПриема) Тогда
		МетодПриема = "Обычный";
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДатаУвольнения) И ДатаУвольнения < ДатаПриема Тогда
		Сообщить("Дата увольнения меньше даты приема.");
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецИспытательногоСрока)
		И КонецИспытательногоСрока < НачалоИспытательногоСрока Тогда
		Сообщить("Конец испытательного срока меньше начала.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка)
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.РегистрНакопленияНадбавок.Записывать = Истина;

	// 7. Надбавки
	Для Каждого СтрокаНадбавки Из Надбавки Цикл
		Если Не ЗначениеЗаполнено(СтрокаНадбавки.Надбавка) Тогда
			Продолжить;
		КонецЕсли;
		Запись = Движения.РегистрНакопленияНадбавок.Добавить();
		Запись.Период      = Дата;
		Запись.Сотрудник   = Сотрудник;
		Запись.Надбавка    = СтрокаНадбавки.Надбавка;
		Запись.ЕдИзм       = СтрокаНадбавки.ЕдИзм;
		Запись.Размер      = СтрокаНадбавки.Размер;
		Запись.ДатаНачала  = СтрокаНадбавки.Начало;
		Запись.ДатаОкончания = СтрокаНадбавки.Конец;
	КонецЦикла;

КонецПроцедуры
