#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Выборка = Справочники.ПричинаОтсутствия.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаОснования = Основания.Добавить();
		СтрокаОснования.Причина = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ВыделенныеСтроки = Элементы.Основания.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано основание.");
		Возврат;
	КонецЕсли;
	СтрокаВыбора = Основания[ВыделенныеСтроки[0]];
	ОповеститьОВыборе(СтрокаВыбора.Причина);
	Закрыть();
КонецПроцедуры

#КонецОбласти
