#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ДатаПриема = '00010101' Тогда
		Сообщить("Не заполнена дата приема.");
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.КонецИспытательногоСрока)
		И Объект.КонецИспытательногоСрока < Объект.НачалоИспытательногоСрока Тогда
		Сообщить("Конец испытательного срока меньше начала.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Документ.ПриемНаРаботу.Форма.ФормаПодбораЗамещающих" Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			Объект.ОтсутствующийСотрудник      = ВыбранноеЗначение.Сотрудник;
			Объект.ПодразделениеОтсутствующего = ВыбранноеЗначение.Подразделение;
			Объект.ДолжностьОтсутствующего     = ВыбранноеЗначение.Должность;
			Объект.ПричинаОтсутствия           = ВыбранноеЗначение.ПричинаОтсутствия;
		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ПриемНаРаботу.Форма.ФормаПодбораОснований" Тогда
		Объект.ПричинаОтсутствия = ВыбранноеЗначение;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МетодПриемаПриИзменении(Элемент)
	Если Объект.МетодПриема = "Замещение" И Не ЗначениеЗаполнено(Объект.ОтсутствующийСотрудник) Тогда
		ПодобратьЗамещающих(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСтавки(Команда)
	ПараметрыФормы = Новый Структура("Подразделение, Должность",
		Объект.Подразделение, Объект.Должность);
	ОткрытьФорму("Документ.ПриемНаРаботу.Форма.ФормаПросмотраСтавок", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗамещающих(Команда)
	ОткрытьФорму("Документ.ПриемНаРаботу.Форма.ФормаПодбораЗамещающих", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОснования(Команда)
	ОткрытьФорму("Документ.ПриемНаРаботу.Форма.ФормаПодбораОснований", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти
