#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ЭлементВыбора Из ВыбранноеЗначение Цикл
		Если ТипЗнч(ЭлементВыбора) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Строка = Объект.ШтатныеЕдиницы.Добавить();
		Строка.Подразделение     = ЭлементВыбора.Подразделение;
		Строка.Должность         = ЭлементВыбора.Должность;
		Строка.ВидФинансирования = ЭлементВыбора.Финансирование;
		Строка.Разряд            = ЭлементВыбора.Разряд;
		Строка.Ставка            = ЭлементВыбора.Ставка;
		Строка.Оклад             = ЭлементВыбора.Оклад;
	КонецЦикла;

	ПересчитатьИтоги();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПересчитатьИтогиПриИзменении(Элемент)
	ПересчитатьИтоги();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьШтатныеЕдиницы(Команда)
	ОткрытьФорму("Документ.УдалениеШтатнойЕдиницы.Форма.ФормаПодбора", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьИтоги()
	Объект.ИтогоОклад = 0;
	Объект.ИтогоСтавок = 0;
	Для Каждого СтрокаШтатнойЕдиницы Из Объект.ШтатныеЕдиницы Цикл
		Объект.ИтогоОклад = Объект.ИтогоОклад + СтрокаШтатнойЕдиницы.Оклад;
		Объект.ИтогоСтавок = Объект.ИтогоСтавок + СтрокаШтатнойЕдиницы.Ставка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
