Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, СтандартнаяОбработка)
	ИтогоОклад = 0;
	ИтогоСтавок = 0;
	Для Каждого СтрокаШтатнойЕдиницы Из ШтатныеЕдиницы Цикл
		ИтогоОклад = ИтогоОклад + СтрокаШтатнойЕдиницы.Оклад;
		ИтогоСтавок = ИтогоСтавок + СтрокаШтатнойЕдиницы.Ставка;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка)
КонецПроцедуры

// Формирует движения по регистрам «Штатные единицы» и
// «Регистр работы со штатным расписанием».
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ШтатныеЕдиницы.Записывать = Истина;
	Движения.РегистрРаботыСоШтатнымРасписанием.Записывать = Истина;

	Для Каждого СтрокаШтатнойЕдиницы Из ШтатныеЕдиницы Цикл

		Если Не ЗначениеЗаполнено(СтрокаШтатнойЕдиницы.Подразделение) Тогда
			Продолжить;
		КонецЕсли;

		Запись = Движения.ШтатныеЕдиницы.Добавить();
		Запись.Период = Дата;
		Запись.ВидФинансирования = СтрокаШтатнойЕдиницы.ВидФинансирования;
		Запись.Подразделение     = СтрокаШтатнойЕдиницы.Подразделение;
		Запись.Должность         = СтрокаШтатнойЕдиницы.Должность;
		Запись.Разряд            = СтрокаШтатнойЕдиницы.Разряд;
		Запись.Ставка            = СтрокаШтатнойЕдиницы.Ставка;
		Запись.Оклад             = СтрокаШтатнойЕдиницы.Оклад;

		Запись = Движения.РегистрРаботыСоШтатнымРасписанием.Добавить();
		Запись.Период = Дата;
		Запись.ВидФинансирования = СтрокаШтатнойЕдиницы.ВидФинансирования;
		Запись.Подразделение     = СтрокаШтатнойЕдиницы.Подразделение;
		Запись.Должность         = СтрокаШтатнойЕдиницы.Должность;
		Запись.Разряд            = СтрокаШтатнойЕдиницы.Разряд;
		Запись.Ставка            = СтрокаШтатнойЕдиницы.Ставка;
		Запись.Оклад             = СтрокаШтатнойЕдиницы.Оклад;

	КонецЦикла;

КонецПроцедуры
