Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, СтандартнаяОбработка)
	Для Каждого СтрокаБольничного Из Сотрудники Цикл
		Если СтрокаБольничного.По < СтрокаБольничного.С Тогда
			Сообщить("Дата окончания больничного меньше даты начала у сотрудника "
				+ СтрокаБольничного.Сотрудник + ".");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка)
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

КонецПроцедуры
